
GAMETEXT = {
    CN:{
        KOJO:{
            Chara1:{
                'first-1':
`“啪嗒啪嗒啪嗒”<br>
一个娇小的少女小跑在教学楼的走廊里，晶龙族的尾巴随着跑动一晃一晃<br>
“真是的~组长太坏心眼了啦~为什么要等到还剩十分钟的时候让人家去实验数据啦！”<br>
少女抱怨着，并没有注意到与她相向而行的你<br>
“嘭！”<br>
你们撞在了一起<br>
“痛痛痛……哎呀，你没事吧？”<br>
少女相比于自己，更先关心起被撞到的你的安危来<br>
“诶？”<br>
她注视着你，忽然睁大了眼睛。
“是$you吗？真的是你吗？”<br>
少女的神色变得泫然欲泣，露出了不自禁的笑容<br>
你想起来，这孩子应该是童年你的青梅竹马，叫做娜娜莉的姑娘<br>
“太好了，太好了！”她猛地抱住了你，随后抱着怀里的资料跑了起来<br>
“人家很快就回来！以后也要请你多多指教啦！”`,

            'first-2':
`双休日的科技馆，是孩子们的乐园<br>
你抱着来消遣的想法，来到了这里<br>
窗明几净的馆内，孩子们围绕着一个少女的讲解员，伴随着少女甜美的声影的解说，游览着科技馆的展品<br>
少女穿着一身纯白的衣裙，轻飘飘地，与白金色的齐胸长发颇为相称，好像妖精一般可爱<br>
可爱的姑娘让你心生好感，于是你便随着她一路走去<br>
……	……<br>
在博物馆内转完一圈，孩子们在家长的带领下各自散去，只剩下了你和她<br>
“辛苦了。”你给她递上了一瓶水<br>
“啊，谢谢你……”<br>
她接过水，指尖相触的瞬间，你们目光相汇<br>
水色的眼睛透明而晶莹，好似水中的海蓝宝石，分外瑰丽<br>
在你的记忆中，也有一个女孩子有着这样的眼睛……你想起了一个名字<br>
“$you！”“娜娜莉！”<br>
你们不约而同地说出了彼此的名字<br>
没想到能在这座城市和儿时的青梅竹马重逢，或许命运会让你们的故事重新继续下去<br>
“以后也要请你多多指教啦~”她歪过头，笑颜如花`,

        },
        EVENT:{},
        DAILY:{},
        ITEM:{},
        UI:{},
        COLOR:{},
        OBJ:{},
    },
    EN:{
        KOJO:{},
        EVENT:{},
        DAILY:{},
        ITEM:{},
        UI:{},
        COLOR:{},
        OBJ:{},
    },
},
}

class Text{
    /**
     * 
     * @param {string} path
     * @param {string} cn 
     * @param {string} en 
     */
    static add(path, cn, en){

    }
}


Text.add(
'KOJO.Chara1.first-1',

`“啪嗒啪嗒啪嗒”<br>
一个娇小的少女小跑在教学楼的走廊里，晶龙族的尾巴随着跑动一晃一晃<br>
“真是的~组长太坏心眼了啦~为什么要等到还剩十分钟的时候让人家去实验数据啦！”<br>
少女抱怨着，并没有注意到与她相向而行的你<br>
“嘭！”<br>
你们撞在了一起<br>
“痛痛痛……哎呀，你没事吧？”<br>
少女相比于自己，更先关心起被撞到的你的安危来<br>
“诶？”<br>
她注视着你，忽然睁大了眼睛。
“是$you吗？真的是你吗？”<br>
少女的神色变得泫然欲泣，露出了不自禁的笑容<br>
你想起来，这孩子应该是童年你的青梅竹马，叫做娜娜莉的姑娘<br>
“太好了，太好了！”她猛地抱住了你，随后抱着怀里的资料跑了起来<br>
“人家很快就回来！以后也要请你多多指教啦！”`,

''

)